export const coursesData = [
  {
    id: "1",
    title: "Введение в программирование",
    description:
      "Курс о основах программирования на языке Python. В ходе курса вы изучите основные концепции программирования, работу с переменными, условиями, циклами и функциями.",
    longDescription:
      "Курс по машинному обучению - это уникальная возможность погрузиться в фундаментальные принципы и методы работы искусственного интеллекта. Участвуя в этом курсе, вы изучите основные алгоритмы машинного обучения, такие как логистическая регрессия, деревья принятия решений, метод опорных векторов, наивный байес и многие другие. Вы также познакомитесь с различными подходами к обучению моделей, включая обучение с учителем, обучение без учителя и обучение с подкреплением. Вы узнаете, как правильно подготавливать и анализировать данные, чтобы эффективно применять методы машинного обучения для решения реальных задач. В рамках курса вы будете решать практические задачи, работая с реальными наборами данных и применяя полученные знания на практике. Это поможет вам освоить ключевые навыки работы с машинным обучением и стать успешным специалистом в этой области. Курс по машинному обучению также обеспечит вас необходимыми знаниями и компетенциями для работы в различных сферах, где данные и аналитика играют важную роль, таких как медицина, финансы, маркетинг и многие другие. После окончания курса вы сможете развивать и улучшать модели машинного обучения, создавая инновационные решения и продукты. Присоединитесь к курсу по машинному обучению и откройте для себя увлекательный мир искусственного интеллекта и анализа данных!",
    image:
      "https://sun3-21.userapi.com/impg/WpfbqLAFRsU22lwg6WtX0CT3kTVs_zLVZqT3wA/q6NEijbXHvQ.jpg?size=1080x1080&quality=95&sign=26a8028f35e2276ed95f0d9e14190e3f&type=album",
    instructor: {
      name: "Иван Иванов",
      qualification: "Программист с 10-летним опытом",
      avatar:
        "https://sun9-56.userapi.com/impg/5ZHeMnCHMP7Fnv7UDjrqCfLSI0BxdnARjwBw5Q/3dOraKoMFzw.jpg?size=1080x1080&quality=95&sign=27d81a297d36ab6c2fa81dd2c239f4ba&type=album",
    },
    duration: "8 недель",
    level: "Начальный",
    price: "$50",
  },
  {
    id: "2",
    title: "Web-разработка",
    description:
      "Курс по изучению HTML, CSS и JavaScript для создания современных веб-сайтов. Вы научитесь создавать адаптивные и интерактивные веб-страницы.",
    longDescription:
      "Курс по машинному обучению - это уникальная возможность погрузиться в фундаментальные принципы и методы работы искусственного интеллекта. Участвуя в этом курсе, вы изучите основные алгоритмы машинного обучения, такие как логистическая регрессия, деревья принятия решений, метод опорных векторов, наивный байес и многие другие. Вы также познакомитесь с различными подходами к обучению моделей, включая обучение с учителем, обучение без учителя и обучение с подкреплением. Вы узнаете, как правильно подготавливать и анализировать данные, чтобы эффективно применять методы машинного обучения для решения реальных задач. В рамках курса вы будете решать практические задачи, работая с реальными наборами данных и применяя полученные знания на практике. Это поможет вам освоить ключевые навыки работы с машинным обучением и стать успешным специалистом в этой области. Курс по машинному обучению также обеспечит вас необходимыми знаниями и компетенциями для работы в различных сферах, где данные и аналитика играют важную роль, таких как медицина, финансы, маркетинг и многие другие. После окончания курса вы сможете развивать и улучшать модели машинного обучения, создавая инновационные решения и продукты. Присоединитесь к курсу по машинному обучению и откройте для себя увлекательный мир искусственного интеллекта и анализа данных!",
    image:
      "https://sun9-76.userapi.com/impf/jreI2S-_hkYm1D_biSNqzr1j6kb7kCNn0-dizg/d7AkkCWinWk.jpg?size=2500x1667&quality=96&sign=9098820514cb907e68fe926918dabb6e&type=album",
    instructor: {
      name: "Мария Петрова",
      qualification: "Веб-разработчик и дизайнер",
      avatar:
        "https://sun9-76.userapi.com/impf/jreI2S-_hkYm1D_biSNqzr1j6kb7kCNn0-dizg/d7AkkCWinWk.jpg?size=2500x1667&quality=96&sign=9098820514cb907e68fe926918dabb6e&type=album",
    },
    duration: "12 недель",
    level: "Средний",
    price: "$80",
    sale: "true",
  },
  {
    id: "3",
    title: "Машинное обучение",
    description:
      "Курс по основам машинного обучения и нейронных сетей. Вы узнаете, как обучать модели, делать прогнозы и работать с данными.",
    longDescription:
      "Курс по машинному обучению - это уникальная возможность погрузиться в фундаментальные принципы и методы работы искусственного интеллекта. Участвуя в этом курсе, вы изучите основные алгоритмы машинного обучения, такие как логистическая регрессия, деревья принятия решений, метод опорных векторов, наивный байес и многие другие. Вы также познакомитесь с различными подходами к обучению моделей, включая обучение с учителем, обучение без учителя и обучение с подкреплением. Вы узнаете, как правильно подготавливать и анализировать данные, чтобы эффективно применять методы машинного обучения для решения реальных задач. В рамках курса вы будете решать практические задачи, работая с реальными наборами данных и применяя полученные знания на практике. Это поможет вам освоить ключевые навыки работы с машинным обучением и стать успешным специалистом в этой области. Курс по машинному обучению также обеспечит вас необходимыми знаниями и компетенциями для работы в различных сферах, где данные и аналитика играют важную роль, таких как медицина, финансы, маркетинг и многие другие. После окончания курса вы сможете развивать и улучшать модели машинного обучения, создавая инновационные решения и продукты. Присоединитесь к курсу по машинному обучению и откройте для себя увлекательный мир искусственного интеллекта и анализа данных!",
    image: "https://hsbi.hse.ru/upload/articles/2021/700/machine-learning.jpg",
    instructor: {
      name: "Алексей Сидоров",
      qualification: "Специалист по машинному обучению",
    },
    duration: "10 недель",
    level: "Продвинутый",
    price: "$100",
    sale: "true",
  },
  {
    id: "4",
    title: "Web Development Bootcamp",
    duration: "8 weeks",
    level: "beginner",
    topics: ["HTML", "CSS", "JavaScript", "Responsive Design", "Git"],
  },
  {
    id: "5",
    title: "Full-Stack Web Development",
    duration: "12 weeks",
    level: "intermediate",
    topics: ["Node.js", "Express", "React", "MongoDB", "GraphQL"],
  },
  {
    id: "6",
    title: "Mobile App Development",
    duration: "10 weeks",
    level: "intermediate",
    topics: ["Swift", "React Native", "Firebase", "iOS/Android Development"],
  },
  {
    id: "7",
    title: "Data Science Fundamentals",
    duration: "6 weeks",
    level: "intermediate",
    topics: ["Python", "Pandas", "NumPy", "Machine Learning", "Data Visualization"],
  },
  {
    id: "8",
    title: "UX/UI Design",
    duration: "8 weeks",
    level: "beginner",
    topics: ["User Research", "Wireframing", "Prototyping", "Adobe XD", "Figma"],
  },
  {
    id: "9",
    title: "Game Development",
    duration: "10 weeks",
    level: "intermediate",
    topics: ["Unity", "C# Programming", "Game Design Principles", "3D Modeling"],
  },
  {
    id: "10",
    title: "Cybersecurity Essentials",
    duration: "6 weeks",
    level: "beginner",
    topics: ["Ethical Hacking", "Network Security", "Cryptocurrency", "Incident Response"],
  },
  {
    id: "11",
    title: "Cloud Computing",
    duration: "8 weeks",
    level: "intermediate",
    topics: ["AWS", "Azure", "Google Cloud Platform", "DevOps"],
  },
  {
    id: "12",
    title: "DevOps Certification",
    duration: "6 weeks",
    level: "intermediate",
    topics: ["Jenkins", "Docker", "Kubernetes", "Continuous Integration/Continuous Deployment"],
  },
  {
    id: "13",
    title: "Blockchain Development",
    duration: "10 weeks",
    level: "intermediate",
    topics: ["Solidity", "Ethereum", "Smart Contracts", "Blockchain Security"],
  },
  {
    id: "14",
    title: "Internet of Things (IoT)",
    duration: "8 weeks",
    level: "intermediate",
    topics: ["Arduino", "Raspberry Pi", "IoT Protocols", "IoT Security"],
  },
  {
    id: "15",
    title: "Artificial Intelligence",
    duration: "12 weeks",
    level: "advanced",
    topics: ["TensorFlow", "Neural Networks", "Natural Language Processing", "Computer Vision"],
  },
  {
    id: "16",
    title: "Big Data Analytics",
    duration: "10 weeks",
    level: "intermediate",
    topics: ["Hadoop", "Spark", "Hive", "Data Warehousing"],
  },
  {
    id: "17",
    title: "Java Programming",
    duration: "6 weeks",
    level: "beginner",
    topics: ["Java Basics", "OOP Concepts", "Collections Framework", "Multithreading"],
  },
  {
    id: "18",
    title: "Python for Data Analysis",
    duration: "8 weeks",
    level: "intermediate",
    topics: ["Data Wrangling", "Data Cleaning", "Data Visualization", "Statistical Analysis"],
  },
  {
    id: "19",
    title: "Frontend Web Development",
    duration: "6 weeks",
    level: "beginner",
    topics: ["HTML5", "CSS3", "JavaScript ES6", "DOM Manipulation"],
  },
  {
    id: "20",
    title: "React Native Mobile Development",
    duration: "8 weeks",
    level: "intermediate",
    topics: ["React Native Basics", "API Integration", "Navigation", "Redux State Management"],
  },
  {
    id: "21",
    title: "Agile Scrum Fundamentals",
    duration: "4 weeks",
    level: "beginner",
    topics: ["Agile Principles", "Scrum Process", "Sprint Planning", "Daily Stand-ups"],
  },
  {
    id: "22",
    title: "Software Engineering Practices",
    duration: "8 weeks",
    level: "intermediate",
    topics: ["Version Control", "Code Reviews", "Unit Testing", "Continuous Integration"],
  },
  {
    id: "23",
    title: "Databases and SQL",
    duration: "6 weeks",
    level: "beginner",
    topics: ["SQL Querying", "Database Design", "Normalization", "Indexing"],
  },
];

export const navigationCourse = [
  {
    id: 1,
    data: [
      {
        name: "Теория",
        data: [
          {
            name: "Введение",
            taskId: 1,
          },
          {
            name: "Какие бывают ЯП",
            taskId: 2,
          },
          {
            name: "Подробнее о языках",
            data: [
              {
                name: "JS",
                taskId: 3,
              },
              {
                name: "Python",
                taskId: 4,
              },
              { name: "C#", taskId: 5 },
            ],
          },
        ],
      },
      {
        name: "Практика",
        data: [
          { name: "Hello world", taskId: 6 },
          { name: "Крестики нолики", taskId: 7 },
        ],
      },
    ],
  },
];

export const tasksData = [
  {
    id: 1,
    name: "Введение",
    text: `Программирование - это ключевой навык в современном мире, который открывает двери к бесчисленным возможностям создания программ, веб-приложений, мобильных приложений и многого другого. Независимо от вашей цели - стать профессиональным разработчиком, освоить навыки автоматизации задач или просто расширить свой кругозор - этот курс предоставит вам крепкие основы, необходимые для успешного старта в мире программирования.

    В этом курсе мы начнем с самых основ. Мы изучим основные концепции программирования, такие как переменные, типы данных, условные операторы, циклы и функции. Мы также рассмотрим основы структур данных и алгоритмов, которые являются фундаментом для разработки эффективных и масштабируемых программ.
    
    Одной из ключевых черт этого курса является практический подход. Мы предоставим вам множество задач и упражнений, которые помогут вам закрепить полученные знания на практике. Кроме того, вы будете иметь возможность работать над реальными проектами, чтобы применить свои навыки в реальном мире.
    
    Не имеет значения, являетесь ли вы начинающим или имеете некоторый опыт в программировании, этот курс предоставит вам надежные фундаментальные знания и поможет вам стать успешным разработчиком программного обеспечения.
    
    Приготовьтесь погрузиться в захватывающий мир программирования, где возможности бесконечны, и давайте вместе начнем этот захватывающий путь!`,
  },
  {
    id: 2,
    name: "Какие бывают ЯП",
    type: "text",
    text: "Языки программирования могут быть классифицированы по различным критериям, таким как уровень абстракции, область применения, парадигмы программирования и другие. Вот некоторые из самых распространенных языков программирования:",
    list: [
      "Java: Объектно-ориентированный язык программирования, широко используемый для создания приложений на сервере, мобильных приложений, веб-приложений и многих других.",
      "Python: Высокоуровневый язык программирования, который славится своей простотой и читаемостью кода. Используется во многих областях, включая науку о данных, искусственный интеллект, веб-разработку и автоматизацию задач.",
      "JavaScript: Язык программирования, используемый для создания динамических веб-страниц и веб-приложений. Широко применяется как на клиентской стороне (в браузере), так и на серверной стороне (Node.js).",
      "Язык программирования, разработанный Microsoft, который часто используется для создания приложений на платформе .NET, включая приложения для Windows и веб-сервисы.",
    ],
  },
  { id: 3, name: "JS", type: "text", video: "https://www.youtube.com/embed/FLxwsuNe2BI" },
  {
    id: 4,
    name: "Python",
    image: "https://www.interviewbit.com/blog/wp-content/uploads/2021/12/Applications-of-Python.png",
  },
  {
    id: 5,
    name: "C#",
    text: "C# — объектно-ориентированный язык программирования общего назначения. Разработан в 1998—2001 годах группой инженеров компании Microsoft.",
    list: [
      "using System;: Эта строка указывает на то, что мы используем пространство имен System, которое содержит базовые классы и структуры, такие как Console, которые используются для ввода и вывода данных.",
      "class Program: Здесь мы определяем класс Program, который содержит нашу программу.",
      "static void Main(): Это метод Main, который является точкой входа в программу. Он является статическим (то есть принадлежит классу, а не экземпляру класса) и не возвращает никакого значения (void).",
      `Console.WriteLine("Hello, world!");: Эта строка кода выводит строку "Hello, world!" в консоль. Метод WriteLine отвечает за вывод строки текста, а Console - это класс, который предоставляет доступ к консоли.`,
    ],
    code: `using System;

    class Program
    {
        static void Main()
        {
            // Выводим "Hello, world!" в консоль
            Console.WriteLine("Hello, world!");
        }
    }`,
  },
  {
    id: 6,
    name: "Hello world",
    type: "text",
    text: "Напишите необходимый код на JS, который вернет в массиве слова Hello и world",
    codeanswer: true,
  },
  {
    id: 7,
    name: "Крестики нолики",
    type: "text",
    text: `Ваша задача - разработать классическую игру "Крестики-нолики", в которой два игрока будут поочередно ставить крестики и нолики на игровом поле. Цель игры - заполнить горизонтальный, вертикальный или диагональный ряд поля одинаковыми символами (крестиками или ноликами) и выиграть партию.`,
    fileanswer: true,
  },
];
